## Terraform Lint/Plan Results
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
cloudflare_record.imap: Refreshing state... [id=ac6aeafd9af224e07c88efdc9b5e4887]
cloudflare_record.www-aaaa: Refreshing state... [id=42ee94b3fab962b8b21d1487ec734fbd]
cloudflare_record.www-a: Refreshing state... [id=5d3ab468a74e6757b07c36226406b661]
cloudflare_record.mx-2: Refreshing state... [id=faafcadfad83b1236f4c929db14f3d18]
cloudflare_record.mx-1: Refreshing state... [id=7f7e451868fc1ffe53a7de678eb3bc93]
cloudflare_record.webmail: Refreshing state... [id=457b0a51b6b0d9041801788e0dfd917f]
cloudflare_record.pop3: Refreshing state... [id=82cb3cd742c7d05bc2d03f25c59c82c3]
cloudflare_record.root-a: Refreshing state... [id=9baadb4a0bef6e6e9e3fa50ab2bfe2c1]
cloudflare_record.smtp: Refreshing state... [id=5f6a7752e884e3c824aae558732f2fd0]
cloudflare_record.root-aaaa: Refreshing state... [id=5c120446a4bc1a2fb3eb480206844313]
cloudflare_record._autodiscover_tcp: Refreshing state... [id=152e2e33d0bd2d72dfa140bb525f829f]
cloudflare_record.mail2: Refreshing state... [id=60581cadb658f04d4d94bae9c8bfbbae]
cloudflare_record.autoconfig: Refreshing state... [id=db6141ae25d9723d0cd72ff53df130e7]
cloudflare_record.mail: Refreshing state... [id=f9cff3da6c43997e0e9eacaac8fbb589]
cloudflare_record.webbmail: Refreshing state... [id=103b1308497abba1cb8bcc4af7c5264f]
b2_bucket.terraform-state: Refreshing state... [id=c33185c9297d9b5484380d18]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_zone_dnssec.tmeit-se-dnssec will be created
  + resource "cloudflare_zone_dnssec" "tmeit-se-dnssec" {
      + algorithm        = (known after apply)
      + digest           = (known after apply)
      + digest_algorithm = (known after apply)
      + digest_type      = (known after apply)
      + ds               = (known after apply)
      + flags            = (known after apply)
      + id               = (known after apply)
      + key_tag          = (known after apply)
      + key_type         = (known after apply)
      + modified_on      = (known after apply)
      + public_key       = (known after apply)
      + status           = (known after apply)
      + zone_id          = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_zone_settings_override.tmeit-se-settings will be created
  + resource "cloudflare_zone_settings_override" "tmeit-se-settings" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + readonly_settings        = (known after apply)
      + zone_id                  = "6a806c0199e15cdf23bb3017a90bf149"
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = "on"
          + always_use_https            = "on"
          + automatic_https_rewrites    = (known after apply)
          + binary_ast                  = (known after apply)
          + brotli                      = "on"
          + browser_cache_ttl           = 14400
          + browser_check               = "on"
          + cache_level                 = "aggressive"
          + challenge_ttl               = 14400
          + ciphers                     = (known after apply)
          + cname_flattening            = (known after apply)
          + development_mode            = "off"
          + early_hints                 = "on"
          + email_obfuscation           = "on"
          + filter_logs_to_cloudflare   = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = "off"
          + http2                       = "on"
          + http3                       = "on"
          + image_resizing              = "off"
          + ip_geolocation              = "on"
          + ipv6                        = "on"
          + log_to_cloudflare           = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = "1.2"
          + mirage                      = "off"
          + opportunistic_encryption    = (known after apply)
          + opportunistic_onion         = "on"
          + orange_to_orange            = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + origin_max_http_version     = (known after apply)
          + polish                      = "off"
          + prefetch_preload            = "on"
          + privacy_pass                = "on"
          + proxy_read_timeout          = (known after apply)
          + pseudo_ipv4                 = "off"
          + response_buffering          = (known after apply)
          + rocket_loader               = "off"
          + security_level              = "essentially_off"
          + server_side_exclude         = "off"
          + sort_query_string_for_cache = (known after apply)
          + ssl                         = "strict"
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = "on"
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + universal_ssl               = "on"
          + visitor_ip                  = (known after apply)
          + waf                         = "off"
          + webp                        = "off"
          + websockets                  = "on"
          + zero_rtt                    = (known after apply)

          + minify {
              + css  = (known after apply)
              + html = (known after apply)
              + js   = (known after apply)
            }

          + mobile_redirect {
              + mobile_subdomain = (known after apply)
              + status           = (known after apply)
              + strip_uri        = (known after apply)
            }

          + security_header {
              + enabled            = (known after apply)
              + include_subdomains = (known after apply)
              + max_age            = (known after apply)
              + nosniff            = (known after apply)
              + preload            = (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @JustinLex, Action: `pull_request`*